In [1]:
import numpy as np
import pandas as pd

In [20]:
dictOri = {'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)}
df = pd.DataFrame(dictOri)

In [5]:
for x in df:
    print(x)

key1
key2
data1
data2

In [7]:
for name, group in df.groupby(['key1']):
    print(name, group)
print("======")
for name, group in df.groupby(['key1', 'key2']):
    print(name, group)

('a',)   key1 key2     data1     data2
0    a  one -1.042417 -0.597558
1    a  two  1.010432  0.679150
4    a  one  0.980495 -1.599689
('b',)   key1 key2     data1     data2
2    b  one -0.142747 -0.608994
3    b  two  0.967797 -0.958283
======
('a', 'one')   key1 key2     data1     data2
0    a  one -1.042417 -0.597558
4    a  one  0.980495 -1.599689
('a', 'two')   key1 key2     data1    data2
1    a  two  1.010432  0.67915
('b', 'one')   key1 key2     data1     data2
2    b  one -0.142747 -0.608994
('b', 'two')   key1 key2     data1     data2
3    b  two  0.967797 -0.958283

In [8]:
list(df.groupby('key1'))

[('a',
    key1 key2     data1     data2
  0    a  one -1.042417 -0.597558
  1    a  two  1.010432  0.679150
  4    a  one  0.980495 -1.599689),
 ('b',
    key1 key2     data1     data2
  2    b  one -0.142747 -0.608994
  3    b  two  0.967797 -0.958283)]

In [14]:
D0 = dict(list(df.groupby('key1')))
D1 = dict(list(df.groupby(['key1','key2'])))

In [15]:
D0['a']

  key1 key2     data1     data2
0    a  one -1.042417 -0.597558
1    a  two  1.010432  0.679150
4    a  one  0.980495 -1.599689

In [13]:
D0['b']

  key1 key2     data1     data2
2    b  one -0.142747 -0.608994
3    b  two  0.967797 -0.958283

In [16]:
D1

{('a',
  'one'):   key1 key2     data1     data2
 0    a  one -1.042417 -0.597558
 4    a  one  0.980495 -1.599689,
 ('a',
  'two'):   key1 key2     data1    data2
 1    a  two  1.010432  0.67915,
 ('b',
  'one'):   key1 key2     data1     data2
 2    b  one -0.142747 -0.608994,
 ('b',
  'two'):   key1 key2     data1     data2
 3    b  two  0.967797 -0.958283}

In [18]:
D1[('b', 'one')]

  key1 key2     data1     data2
2    b  one -0.142747 -0.608994

In [19]:
D1[('a', 'one')]

  key1 key2     data1     data2
0    a  one -1.042417 -0.597558
4    a  one  0.980495 -1.599689

In [22]:
len(D1[('b', 'one')])

1

In [23]:
g01 = df.groupby('key1')
len(g01)

2

In [25]:
dict(list(g01))

{'a':   key1 key2     data1     data2
 0    a  one -0.533349 -0.334663
 1    a  two -1.009468  0.164693
 4    a  one  0.286848  1.148616,
 'b':   key1 key2     data1     data2
 2    b  one  1.194405 -1.361994
 3    b  two -1.213394 -0.428036}

In [26]:
g01['data1'].mean()

key1
a   -0.418656
b   -0.009495
Name: data1, dtype: float64

In [27]:
# 多個統計Function
g01['data2'].agg(func = ['mean', 'sum', 'max', 'min'])

          mean       sum       max       min
key1
a    -0.418656 -1.255969  0.286848 -1.009468
b    -0.009495 -0.018989  1.194405 -1.213394

In [37]:
g01['data1'].agg([('平均','mean'),('加總','sum'),'max','min'])

            平均        加總       max       min
key1
a    -0.418656 -1.255969  0.286848 -1.009468
b    -0.009495 -0.018989  1.194405 -1.213394